# ExternalDefinitionCreationOptions Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDefinitionCreationOptions Methods
ExternalDefinitionCreationOptions Class See Also
---
The ExternalDefinitionCreationOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDataType | Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetDataType | Sets the parameter's data type. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace